detail_data/k6関係/1000_10_2NT.txt

     data_received..................: 2.0 GB 245 MB/s
     data_sent......................: 86 kB  10 kB/s
     http_req_blocked...............: avg=75.09µs  min=0s      med=0s      max=6.98ms   p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=7.09µs   min=0s      med=0s      max=709.7µs  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=78.25ms  min=44.87ms med=68.58ms max=631.22ms p(90)=99.64ms  p(95)=113.19ms
       { expected_response:true }...: avg=78.25ms  min=44.87ms med=68.58ms max=631.22ms p(90)=99.64ms  p(95)=113.19ms
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=27.41ms  min=6.98ms  med=23.07ms max=127.11ms p(90)=47.79ms  p(95)=56.65ms 
     http_req_sending...............: avg=220.21µs min=0s      med=0s      max=11.04ms  p(90)=542.44µs p(95)=1.02ms  
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=50.61ms  min=33.07ms med=43.13ms max=581.6ms  p(90)=57.62ms  p(95)=64.24ms 
     http_reqs......................: 1000   121.296583/s
     iteration_duration.............: avg=78.72ms  min=44.87ms med=69.04ms max=639.32ms p(90)=100.79ms p(95)=114.72ms
     iterations.....................: 1000   121.296583/s
     vus............................: 4      min=4         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 277 MB/s
     data_sent......................: 86 kB  12 kB/s
     http_req_blocked...............: avg=94.53µs min=0s      med=0s      max=9.94ms   p(90)=0s      p(95)=0s      
     http_req_connecting............: avg=13.37µs min=0s      med=0s      max=2.92ms   p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=67.5ms  min=44.28ms med=63.42ms max=166.05ms p(90)=90.06ms p(95)=100.63ms
       { expected_response:true }...: avg=67.5ms  min=44.28ms med=63.42ms max=166.05ms p(90)=90.06ms p(95)=100.63ms
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=22.8ms  min=6.01ms  med=18.51ms max=92.66ms  p(90)=41.53ms p(95)=50.94ms 
     http_req_sending...............: avg=233µs   min=0s      med=0s      max=12.21ms  p(90)=0s      p(95)=1.3ms   
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=44.46ms min=33.24ms med=42.59ms max=100.26ms p(90)=54.86ms p(95)=59.76ms 
     http_reqs......................: 1000   137.084048/s
     iteration_duration.............: avg=67.85ms min=44.35ms med=63.71ms max=171.4ms  p(90)=90.65ms p(95)=101.62ms
     iterations.....................: 1000   137.084048/s
     vus............................: 4      min=4         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 287 MB/s
     data_sent......................: 86 kB  12 kB/s
     http_req_blocked...............: avg=68.19µs  min=0s      med=0s      max=6.38ms   p(90)=0s      p(95)=0s      
     http_req_connecting............: avg=5.77µs   min=0s      med=0s      max=811.1µs  p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=68.01ms  min=44.28ms med=63.95ms max=135.61ms p(90)=89.71ms p(95)=100.18ms
       { expected_response:true }...: avg=68.01ms  min=44.28ms med=63.95ms max=135.61ms p(90)=89.71ms p(95)=100.18ms
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=24.76ms  min=7.83ms  med=21.84ms max=81.51ms  p(90)=40.76ms p(95)=48.74ms 
     http_req_sending...............: avg=233.54µs min=0s      med=0s      max=37.3ms   p(90)=0s      p(95)=999.81µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=43.02ms  min=32.29ms med=40.44ms max=100.34ms p(90)=53.84ms p(95)=60.98ms 
     http_reqs......................: 1000   142.038621/s
     iteration_duration.............: avg=68.38ms  min=44.28ms med=64.32ms max=135.6ms  p(90)=90.22ms p(95)=100.38ms
     iterations.....................: 1000   142.038621/s
     vus............................: 1      min=1         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 283 MB/s
     data_sent......................: 86 kB  12 kB/s
     http_req_blocked...............: avg=99.57µs  min=0s      med=0s      max=8.25ms   p(90)=0s       p(95)=0s     
     http_req_connecting............: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s     
     http_req_duration..............: avg=69.39ms  min=46.3ms  med=66.15ms max=147.57ms p(90)=89.75ms  p(95)=98.98ms
       { expected_response:true }...: avg=69.39ms  min=46.3ms  med=66.15ms max=147.57ms p(90)=89.75ms  p(95)=98.98ms
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=26.39ms  min=9.23ms  med=23.78ms max=93.75ms  p(90)=42.03ms  p(95)=48.08ms
     http_req_sending...............: avg=221.31µs min=0s      med=0s      max=22.36ms  p(90)=232.94µs p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s     
     http_req_waiting...............: avg=42.78ms  min=33.11ms med=40.31ms max=98.71ms  p(90)=52.24ms  p(95)=57.63ms
     http_reqs......................: 1000   140.185971/s
     iteration_duration.............: avg=69.94ms  min=46.3ms  med=66.54ms max=148.11ms p(90)=90.41ms  p(95)=99.3ms 
     iterations.....................: 1000   140.185971/s
     vus............................: 6      min=6         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 278 MB/s
     data_sent......................: 86 kB  12 kB/s
     http_req_blocked...............: avg=91.82µs  min=0s      med=0s      max=7.82ms   p(90)=0s      p(95)=0s      
     http_req_connecting............: avg=3.98µs   min=0s      med=0s      max=774.3µs  p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=69.42ms  min=44.46ms med=66.15ms max=154.13ms p(90)=88.89ms p(95)=96.65ms 
       { expected_response:true }...: avg=69.42ms  min=44.46ms med=66.15ms max=154.13ms p(90)=88.89ms p(95)=96.65ms 
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=25.73ms  min=9.53ms  med=22.98ms max=69.63ms  p(90)=41.45ms p(95)=48.43ms 
     http_req_sending...............: avg=210.52µs min=0s      med=0s      max=19.3ms   p(90)=0s      p(95)=993.36µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=43.48ms  min=33.8ms  med=41.03ms max=116.14ms p(90)=52.71ms p(95)=61.09ms 
     http_reqs......................: 1000   137.540336/s
     iteration_duration.............: avg=70.05ms  min=44.55ms med=66.66ms max=154.13ms p(90)=89.62ms p(95)=97.6ms  
     iterations.....................: 1000   137.540336/s
     vus............................: 4      min=4         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 284 MB/s
     data_sent......................: 86 kB  12 kB/s
     http_req_blocked...............: avg=116.52µs min=0s      med=0s      max=10.77ms  p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=7.32µs   min=0s      med=0s      max=845.4µs  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=68.46ms  min=45.58ms med=64.79ms max=156.09ms p(90)=87.99ms p(95)=96.33ms
       { expected_response:true }...: avg=68.46ms  min=45.58ms med=64.79ms max=156.09ms p(90)=87.99ms p(95)=96.33ms
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=25.46ms  min=6.85ms  med=22.87ms max=83.2ms   p(90)=40.4ms  p(95)=45.4ms 
     http_req_sending...............: avg=254.74µs min=0s      med=0s      max=18.23ms  p(90)=63.38µs p(95)=1.1ms  
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=42.74ms  min=33.46ms med=40.07ms max=101.65ms p(90)=52.69ms p(95)=59.33ms
     http_reqs......................: 1000   140.352707/s
     iteration_duration.............: avg=69.03ms  min=45.61ms med=65.27ms max=166.06ms p(90)=88.89ms p(95)=97.83ms
     iterations.....................: 1000   140.352707/s
     vus............................: 2      min=2         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 283 MB/s
     data_sent......................: 86 kB  12 kB/s
     http_req_blocked...............: avg=87.99µs  min=0s      med=0s      max=6.95ms   p(90)=0s      p(95)=0s      
     http_req_connecting............: avg=5.85µs   min=0s      med=0s      max=585.9µs  p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=68.07ms  min=44.99ms med=63.23ms max=154.39ms p(90)=90.59ms p(95)=101.06ms
       { expected_response:true }...: avg=68.07ms  min=44.99ms med=63.23ms max=154.39ms p(90)=90.59ms p(95)=101.06ms
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=24.95ms  min=7.2ms   med=21.34ms max=116.08ms p(90)=41.63ms p(95)=49.32ms 
     http_req_sending...............: avg=206.26µs min=0s      med=0s      max=50.78ms  p(90)=0s      p(95)=989.11µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=42.91ms  min=32.71ms med=39.93ms max=113.94ms p(90)=54.1ms  p(95)=61.75ms 
     http_reqs......................: 1000   139.786129/s
     iteration_duration.............: avg=68.53ms  min=45.22ms med=63.63ms max=154.39ms p(90)=91.42ms p(95)=102.04ms
     iterations.....................: 1000   139.786129/s
     vus............................: 2      min=2         max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 298 MB/s
     data_sent......................: 86 kB  13 kB/s
     http_req_blocked...............: avg=81.06µs  min=0s      med=0s      max=6.02ms   p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=6.51µs   min=0s      med=0s      max=651.9µs  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=65.61ms  min=44.79ms med=62.02ms max=148.02ms p(90)=85.32ms p(95)=92.34ms
       { expected_response:true }...: avg=65.61ms  min=44.79ms med=62.02ms max=148.02ms p(90)=85.32ms p(95)=92.34ms
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=24.27ms  min=10.12ms med=21.27ms max=72.27ms  p(90)=40.37ms p(95)=47.18ms
     http_req_sending...............: avg=273.33µs min=0s      med=0s      max=23.27ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.07ms  min=33.13ms med=38.84ms max=106.07ms p(90)=48.78ms p(95)=56.5ms 
     http_reqs......................: 1000   147.641377/s
     iteration_duration.............: avg=65.99ms  min=44.79ms med=62.38ms max=148.02ms p(90)=85.94ms p(95)=92.97ms
     iterations.....................: 1000   147.641377/s
     vus............................: 10     min=10        max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 295 MB/s
     data_sent......................: 86 kB  13 kB/s
     http_req_blocked...............: avg=93.07µs  min=0s      med=0s      max=7.92ms   p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=7.04µs   min=0s      med=0s      max=1.55ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.34ms  min=38.42ms med=62.84ms max=138.81ms p(90)=85.43ms p(95)=94.1ms 
       { expected_response:true }...: avg=66.34ms  min=38.42ms med=62.84ms max=138.81ms p(90)=85.43ms p(95)=94.1ms 
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=24.65ms  min=2.42ms  med=21.93ms max=81.26ms  p(90)=39.68ms p(95)=46.56ms
     http_req_sending...............: avg=238.05µs min=0s      med=0s      max=19.72ms  p(90)=0s      p(95)=1.03ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.45ms  min=32.16ms med=38.84ms max=114.65ms p(90)=50.58ms p(95)=58.98ms
     http_reqs......................: 1000   145.897558/s
     iteration_duration.............: avg=66.81ms  min=38.42ms med=63.07ms max=142.12ms p(90)=86.64ms p(95)=94.58ms
     iterations.....................: 1000   145.897558/s
     vus............................: 10     min=10        max=10
     vus_max........................: 10     min=10        max=10


     data_received..................: 2.0 GB 291 MB/s
     data_sent......................: 86 kB  12 kB/s
     http_req_blocked...............: avg=114.19µs min=0s      med=0s      max=9.45ms   p(90)=0s      p(95)=0s     
     http_req_connecting............: avg=5.63µs   min=0s      med=0s      max=950.4µs  p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=66.5ms   min=12.28ms med=63.11ms max=159.32ms p(90)=85.64ms p(95)=93.84ms
       { expected_response:true }...: avg=66.5ms   min=12.28ms med=63.11ms max=159.32ms p(90)=85.64ms p(95)=93.84ms
     http_req_failed................: 0.00%  0 out of 1000
     http_req_receiving.............: avg=24.77ms  min=0s      med=22.67ms max=93.79ms  p(90)=38.73ms p(95)=47.38ms
     http_req_sending...............: avg=236.27µs min=0s      med=0s      max=73.02ms  p(90)=0s      p(95)=1ms    
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=41.49ms  min=997.6µs med=38.94ms max=110.39ms p(90)=50.85ms p(95)=58.03ms
     http_reqs......................: 1000   143.939562/s
     iteration_duration.............: avg=67.03ms  min=12.28ms med=63.48ms max=166.75ms p(90)=86.39ms p(95)=95.18ms
     iterations.....................: 1000   143.939562/s
     vus............................: 10     min=10        max=10
     vus_max........................: 10     min=10        max=10